### Pandas Lab -- Basic Selecting & Querying

This lab walks you through various sections of Pandas syntax for grabbing & selecting data.

The lab is broken down into three parts, and will be completed throughout class.

 - 1. Basic selectors with Pandas
 - 2. Selecting based on conditions & boolean indexes
 - 3. Special commands for selecting certain types of rows

In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv(r"/Users/PRSmb/OneDrive/General-Assembly/my-1019-repo/ClassMaterial/Unit2/Practice/titanic.csv")

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Section 1:  Selecting Data With Pandas

**1). What is the average age of all passengers on board?**

In [6]:
# your answer here

df['Age'].mean()

29.69911764705882

**2). What are the median values of the Fare & SibSp columns?**

In [ ]:
# your answer here

In [7]:
df['Fare'].median()

14.4542

In [8]:
df['SibSp'].median()

0.0

**3). What was the maximum fare paid among the first 100 passengers on board? (This would be the first 100 rows)**

In [ ]:
# your answer here

In [9]:
df['Fare'][:100].max()

263.0

**4). What is the modal value of the last 4 columns in the dataset?**

In [14]:
# your answer here

df.iloc[:,-4:].mode(axisb=0)

     Ticket  Fare        Cabin Embarked
0      1601  8.05      B96 B98        S
1    347082   NaN  C23 C25 C27      NaN
2  CA. 2343   NaN           G6      NaN

In [23]:
df['Ticket'].value_counts().sort_values(ascending=False)

CA. 2343             7
1601                 7
347082               7
347088               6
3101295              6
                    ..
STON/O 2. 3101280    1
2629                 1
370376               1
PC 17476             1
345763               1
Name: Ticket, Length: 681, dtype: int64

**5). What is the mean value of the first 250 rows of the first 3 columns in the dataset?**

In [ ]:
# your answer here

In [24]:
df.iloc[:250,:3].mean()

PassengerId    125.500
Survived         0.344
Pclass           2.416
dtype: float64

### Section II: Selecting Based on Conditions

**1). How many females were on board the titanic? Men?**

In [ ]:
# your answer here

In [25]:
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

**2). What was the survival rate for females on the titanic? Men?**

In [ ]:
# your answer here

In [66]:
a = df['Survived'][(df['Sex']=='male')].sum()/(df['Sex']=='male').sum()
print(f"male survival rate: {a}")

male survival rate: 0.18890814558058924

In [67]:
a = df['Survived'][(df['Sex']=='female')].sum()/(df['Sex']=='female').sum()
print(f"female survival rate: {a}")

female survival rate: 0.7420382165605095

**3). What was the survival rate for people in either passenger class 1 or 2?**

In [ ]:
# your answer here

In [52]:
((df['Pclass']==1)|(df['Pclass']==2)).sum()

400

In [53]:
df['Survived'][(df['Pclass']==1)|(df['Pclass']==2)].sum()/((df['Pclass']==1)|(df['Pclass']==2)).sum()

0.5575

**4). Were woman more likely to survive if they were traveling without siblings?**

In [ ]:
# your answer here

In [59]:
[(df['Sex']=='female')&(df['SibSp']>0)]

[0      False
 1       True
 2      False
 3       True
 4      False
        ...
 886    False
 887    False
 888     True
 889    False
 890    False
 Length: 891, dtype: bool]

In [64]:
a = df['Survived'][(df['Sex']=='female')&(df['SibSp']>0)].sum()/((df['Sex']=='female')&(df['SibSp']>0)).sum()
print(f"female survival rate with siblings: {a}")

female survival rate with siblings: 0.6857142857142857

In [65]:
a = df['Survived'][(df['Sex']=='female')&~(df['SibSp']>0)].sum()/((df['Sex']=='female')&~(df['SibSp']>0)).sum()
print(f"female survival rate without siblings: {a}")

female survival rate without siblings: 0.7873563218390804

Yes - woman were more likely to survive if they travelled without siblings